Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON ID>EN Tales of Sarimin The Jinn.tmx
Source language: id
Languages: en

source: Apakah ada hewan liar yang mampir!?
en: are there any wild animals around?!

source: BERTAMBAH KUAT
en: get even

source: PEKERJAAN INI...
en: I work hard

source: TIDAK MELAWAN
en: a single punch.

source: DEMI MENYAMBUNG HIDUP SELURUH WARGANYA..
en: and to preserve the tradition that keeps everyone prosperous...

source: SEKARANG..
en: so confused...

source: CKIITT
en: screech

source: JIJIK..!!
en: with his hair?!

source: Tapi kenapa harus keluarga kita?!
en: but, why us?!

source: NGOMONG,
en: mr.

source: AH!!
en: huh?!

source: KELAS, BIAYA SEKOLAH-
en: to be held back a grade,

source: BYUR!
en: bloop

source: DARI TOPIK,
en: change the subject.

source: Tadi ada yang sempat masuk ke tenda mereka, mah..
en: I saw some of them trying to get into the tent.

source: KAU INI BENAR0-BENAR---
en: are you serious-

source: KYAA!
en: kyaaa!

source: AKAN BERHASIL,
en: work,

source: ANDA, PAK SUNARYO..
en: this instant.

source: KITA PERNAH
en: we met

source: NYAANKU!!!
en: me!

source: DENGAN BAU
en: the scent

source: KAN UANG INI KEPADA
en: the money back

source: APAKAH JIN
en: the monkey jinn

source: RRR
en: whir

source: SI MA--
en: completely--

source: Atau setan... !?!?!?
en: or ghosts?!

source: K-KENAPA
en: what’s

source: AKU BAIK-BAIK,
en: carefully,

source: MAS..
en: you know...

source: OH IYA,
en: anyway,

source: APAKAH ANDA MASIH
en: you still don’t

source: DRRR
en: bzzt

source: DUKUN BIASA, YA?
en: a shaman are you?

source: HANYA ADA AKU DAN
en: there were

source: KALAU ADA SETAN-
en: what if there are

source: SOALNYA JALAN MENUJU CAMPING GROUNDNYA SUDAH LEBIH BAGUS, KAK..
en: yes, because the road had been repaired, we got here faster.

source: MENYERANGKU
en: attacking

source: LAIN SAJA YANG
en: others

source: KEDUA..
en: a second chance...

source: GUSRAK!
en: rustle

source: KENAPA MALAH
en: hey, what the heck

source: SWASTA ILLEGAL
en: as a private detective.

source: GYYYAAAHHHHHH!!!!
en: aaaahhhhh!!!

source: SESUATU YANG SENGAJA MENYEM-BUNYIKAN PUTRIKU?!
en: something that keeps my daughter hidden?!

source: KEBAHAGIAAN YANG
en: joy that

source: AKU BELAJAR
en: I learned

source: DUKUN TERKUAT
en: the strongest shaman

source: GREP!!
en: grab

source: HARI INI!
en: today!

source: MAIN SURUH-
en: ordering me around

source: MESKIPUN
en: even with

source: YAH, TAPI KALAU
en: well,

source: Kalau benar lagi marahan, mungkin sebaiknya boss Sima ikutan kami senam, yuk!
en: then I’d encourage you to join us for some fun aerobics!

source: YAK DIULANG LAGI!!
en: one more time!

source: KAN…
en: yourself...

source: SETAN MANAPUN!!
en: from any demon again!

source: GROOK!!
en: snort

source: Kepo, neh..
en: just out of curiosity...

source: ..MEREKA
en: so...

source: Ja..
en: d-

source: U-UWAH!!
en: wh-whoaa!!!

source: MAH..
en: mom.

source: ITU?!?!
en: doll?!

source: AHH…
en: argh...

source: KUAT?!!
en: powerful?!

source: Oiya, kalau kau mau, kau boleh memiliki konsol game yang kubawa dari dunia manusia
en: oh, and if you want, you can have the video game console I brought with me from the human world.

source: SOAL ITU, KAN?!
en: with this concept, no?!

source: TAPI KAMU BERHASIL BERTAHAN, AKU SALUT PADAMU!
en: but you made it through! I’m so happy for you!

source: IYA IYA HABIS INI PELAN-PELAN DEH..
en: okay, okay. I’ll drive slowly now.

source: KETEMU WASA AKAN
en: our call, it would’ve

source: GIMANA?
en: how do you feel?

source: BISNISKU..
en: with my business...

source: (TAS SNACK)
en: (bag of snacks)

source: TUNGGU, TUNGGU..
en: hey, hey...

source: BERHATI-HATI
en: more careful.

source: Kau punya waktu sekitar 7 hari..
en: you have about 7 days...

source: RAME JUGA..
en: so many people!

source: MENYESAL
en: regretting

source: TRESNO, YA..
en: than tresno here...

source: JOB DI KOTA ITU
en: when I was there.

source: BIASA….
en: amazing...

source: GR
en: roar

source: AREA TERLARANG
en: RESTRICTED AREA

source: Mimpi yang indah..
en: sleep tight...

source: AH, IYA..
en: oh,

source: Nyawa!?
en: our lives?!

source: BUGH
en: pow

source: DONG!!
en: ones!

source: BISA DISURUH
en: I order

source: DAN HARUS DIAMPUTASI..
en: and they had to amputate it.

source: DEH…
en: too.

source: Bersambung
en: to be continued...

source: ITUKAH DIRIMU?
en: is that you?

source: SAYA..!!
en: for me?

source: TERJADI SESUATU
en: something happened

source: Karena itulah kamu membuatnya tersesat di hutan, kan?
en: and that’s why you made her lost in the forest.

source: KALAU MAU
en: If you want

source: Benar dugaanku..
en: I was right...

source: SEBELUM MENINGGAL,
en: before they died,

source: INI…?!?!
en: power?!

source: TAPI SUAMIKU..
en: but, my husband...

source: Dasar muka dua...
en: what a two-faced scumbag.

source: AH, AYAH
en: oh,

source: KABUR?!
en: you going?!

source: Kenapa?
en: why?

source: Lalu bagaimana caranya kita pergi dari sini?!
en: then, how do we get out of here?!

source: DALAM DIRIMU
en: within you

source: BUKA
en: he ran

source: HATIKU JADI BER-
en: you’re gonna make my heart

source: KEMARI-
en: get

source: KIKKK..
en: eekkk...

source: ANAK BARU INI KENAPA NGGAK BECUS NGAPA-NGAPAIN!!
en: this new guy can’t even do a petty job!

source: JDUK!
en: thud

source: BRUK!!
en: thud

source: MATI DITERJANG
en: get gored

source: JIWA-JIWA
en: the spirits

source: HIHIHII….
en: hehehe...

source: BLETAK!!
en: thud

source: MEMANG
en: even though

source: BANGUN..!!
en: wake up!

source: MU?!
en: saying?!

source: A-AKU
en: maybe I should

source: LAGI..!?
en: the...?!

source: GRETEK
en: rattle

source: NGGAK,
en: no,

source: BL
en: thud

source: TERUS TERJADI TANPA
en: and we couldn’t

source: DIA BILANG KALAU
en: he was

source: JIN ULAR
en: a white serpent jinn

source: GROK!
en: oink

source: TERJADI?!?!
en: going on?!

source: EH, AYO MAIN KE LOKASI OUTBOND!
en: let’s check out the adventure playground!

source: TRESNO* PADAKU…
en: he’s not in *tresno with me after all...

source: AH, TAPI
en: oh,

source: MAAF YA
en: sorry that

source: SIALAN,
en: crap,

source: *RABA*
en: feel

source: KEJIMU BERAKHIR
en: of terrorizing my people

source: SEPERTINYA
en: I guess

source: MANA SINYAL!?
en: I have no reception.

source: KALAU DIA MAU
en: if he really wanted

source: DIA DI LUAR SANA SENDIRIAN..
en: she’s alone out there...

source: JLEB!
en: stab

source: ..KELANJUTAN-
en: and then, well...

source: MASIH TIDUR
en: he

source: Ayo konsentrasi, Suro..
en: come on, focus, suro...

source: Barusan nendang lagi, tuh...
en: he just started kicking again.

source: GREB!!
en: grab

source: YEEETTT..!!
en: hiya!!!

source: DI DEKAT SANA
en: from where we found his body

source: RUMAH WASA LEBIH
en: you won’t make it on time

source: KE SINI BENTAR
en: to go, right?

source: ANAK ITU KAN ANAK RUMAHAN!
en: so she wouldn’t venture out on her own!

source: Ngapain sih iseng banget!!!
en: would you stop that?!

source: KENAPA...
en: why?

source: ITU… YA SUDAH, KITA
en: oh, well,

source: AMPUN, AMPUN!
en: okay, I’ll stop!

source: MEMEJAMKAN MATA..
en: my eyes,

source: GONDRONG!!
en: aura anymore!

source: JAWAB PERTA-
en: answer

source: LUNAS…
en: fully paid...

source: YA YA..
en: all right, all right,

source: SEMBUNYI DARI-NYA!!!!
en: get away from him!

source: KAKI-
en: his leg

source: EEH-BABI NGEPET..!!!
en: I mean, a demon boar!!!

source: POKOKNYA
en: from this

source: SA..
en: are you

source: UHUK!
en: ahem

source: BUTUH TRAINING..
en: practice.

source: KALAU UDAHAN,
en: if you two are done,

source: Agama
en: Religion

source: MENYERAHKAN TEMPAT
en: this ground

source: NGOBROL DI SITU?
en: are you two talking about?!

source: LEBIH ENAK!!
en: face to face!

source: HADIAHNYA BEASISWA
en: he got a scholarship

source: MAU!!
en: get it!

source: FYUHH..
en: phew...

source: PACARAN DI SINI,
en: don’t mess around beneath this tree,

source: Bagaimana ini!?!?!
en: what do we do?!

source: Eh?
en: huh?

source: JANGAN LEWAT SITU, PAK!
en: I don’t think we should take that route.

source: SEKALIHHH!!!
en: in the sky~

source: KUALAT..
en: to happen to me.

source: SYUU
en: whoosh

source: KACAMATA CADANGANKU..
en: are my spare glasses.

source: JEJADIAN..
en: in the form of a snake...

source: Sekali lagi saya minta maaf atas ketidaknyamannya, tuan!
en: again, I apologize for the inconvenience I have caused, sir!

source: DINAMAKAN
en: he’s a demon

source: W..
en: what?

source: PEKA, YA?!
en: huh?

source: ..APA YANG
en: what have

source: INI CUMA MIMPI!!!
en: it’s only a dream!

source: AKU MENGERTI
en: I see...

source: KURANG
en: TRY

source: JRENG!!!
en: dun

source: AKAN BERHATI-
en: more careful

source: SEKALI..!!
en: odd!

source: EPISODE BERAPA?
en: did you first appear?

source: APA YANG KAU
en: what the heck

source: UWAAHH!!
en: yaaay!

source: Sama seperti saat aku pergi mencari nat!!
en: this also happened when I was looking for natasya!

source: JADI BISA LIHAT
en: have I been able

source: LANCAR..
en: just fine.

source: Sabar..
en: focus...

source: KEREN...
en: so cool...

source: UNTUNG ADA AYAH..
en: I’m so grateful for you...

source: ..AKU BERJANJI
en: I promise

source: Aku kan mencoba berkomunikasi dengan tuan Sima lagi..
en: I’ll try to talk to him.

source: *GELUNDUNG*
en: *roll*

source: Tolong segera kemari, penjaga!!
en: guards! please, hurry!

source: KAMU TAHU DARI-
en: how did you know

source: KAK NATASYA TUH DI SEKOLAH SEBENARNYA PUNYA---
en: at school, natasya actually has a--

source: CINTA AYAH PADA
en: I love you,

source: Kiri...
en: look left,

source: Benarkah?
en: really?

source: KENAPA-NAPA
en: okay.

source: DI AUTOPSI JADI KITA
en: an autopsy. So,

source: ALARM..
en: has been set.

source: SRUT!
en: slip

source: SEBENTAR BUAT
en: get some

source: CEPAT
en: hurry

source: UDAH LEWAT JAUH TADI..
en: it’s far behind us already.

source: KOTA Y
en: Y TOWN

source: MASIH PAGI UDAH
en: it’s

source: BUAT, KARENA JAM
en: be helped, since

source: Dasar kucheng garong pelit!!
en: he really is a lousy cheapskate!

source: GYAAAAAAAA….!!!!!
en: aaaaaaa!!!

source: ISTRINYA BELUM,
en: a girlfriend?

source: KOK DIAM SAJA?
en: why are you so quiet?

source: PULA..
en: Illegally, of course.

source: DRAP!
en: stomp

source: TERLARANG INI..
en: love...

source: Melihat keributan antar manusia adalah hiburan tersendiri bagi kaum kita, kan?
en: our kind enjoys causing havoc among humans, don’t we? It’s in our blood.

source: ANEH SEPERTI WAKTU
en: I keep my nose clean

source: HAL ANEH BENAR-
en: something weird

source: INI DALANE
en: and behave yourself,

source: BAHAYA..
en: here.

source: TAPI SUDAH MAMAH MARAHIN..
en: but don’t worry, I’ve scolded him.

source: KALAU
en: What would you do

source: BERJATUHAN
en: to these mysterious occurrences.

source: KAU BISA MELAWAN
en: you’ve got the strength

source: ADA KORBAN YANG
en: still being treated

source: HUP, UNTUNGLAH
en: thank god

source: SI..
en: wh-

source: PUTIH!!
en: resides here.

source: SAKTI..!!
en: the legendary white monkey jinn!

source: TERIMA KASIH!
en: oh, thank you!

source: KHH-
en: give me

source: MELADENI DUKUN
en: the real

source: SEMUANYA SUDAH
en: we’re

source: BERGOSIP TENTANG
en: of talking about

source: AKU NGGAK MAU
en: and I don’t want to

source: GAK JELAS KAYAK
en: like him,

source: JANTUNGKU KIAN
en: my heart

source: TIDAK ADA YANG PERLU KAMU BALAS!!!
en: no need to pay anything back!

source: MENGEMBALIKAN ADIT
en: return adit

source: AW…..
en: ouch...

source: SUDAH PASANG
en: the alarm

source: DENGANKU, NAMUN MALAH
en: instead

source: Naik-naik ke puncak gunung (7)
en: let’s climb to the mountain top (7)

source: Ya ampun, kakakmu itu baru saja ngilang di gunung, kita pulang saja, ya?
en: oh, my dear, I’m so sorry, but your sister has just been found. so, we’d better go home, okay?

source: INI DENGAN MUDAH
en: to them

source: Tumbal telah tiba!
en: there it is!

source: Tidak akan ada bantuan yang datang
en: no one will come for you.

source: AYAH, AYAH!
en: quick, honey!

source: ADUH,
en: crap...

source: saya dan tuan Sarimin mengadakan acara senang poco-poco, pesertanya sekarang makin banyak, lho!
en: mr. sarimin and I are hosting a routine aerobics class, and the number of participants keeps growing, boss!

source: DENGAN POHON
en: about

source: BIAR AKU CEK..
en: let me check...

source: BENDERANG…
en: and bright...

source: LOKASI PROYEK!!
en: would visit me at work!

source: MEREPOTKANMU..
en: troubling you...

source: MENGAMBIL NYAWA
en: takes

source: HARUS PANTAU
en: to monitor

source: MASIH BAGUS,
en: the newer

source: MAIN DENGANMU,
en: with a snotty shaman

source: MANUSIA!!
en: humans!

source: Aku tidak peduli kalian bakal dapat refund atau tidak..
en: I don’t care whether or not you’ll get your refund.

source: BISA MENANG..!!
en: to come out of this alive!

source: ORANG-ORANG SEPERTI
en: I want

source: TENANGKAN DIRIMU..
en: and try to calm yourself down.

source: AKU HARUS
en: I need

source: TIDAK..
en: oh, no...

source: SATU HAL..
en: a valuable lesson...

source: SIANG, NIH!!
en: already!

source: BERI TAHU
en: tell me,

source: TITIK TERANG UNTUK
en: haven’t closed

source: KE DUNIA MANUSIA
en: to the human world

source: DI DIMENSI
en: earthquake

source: BANGUN
en: wake

source: YANG CUKUP KUAT
en: be strong enough

source: CKLAK!!
en: click

source: RINGAN SEPERTI
en: like a lovely cloud

source: Kau pergi tanpa memberitahu mereka..
en: you just left without telling them.

source: Te..
en: I...

source: ANAKMU PINTAR
en: you have

source: TUH, KAN!!
en: see?!

source: BEGINI?!
en: huh?!

source: KALAU TIDAK..
en: or else...

source: SAYA BISA LANGSUNG
en: I’ll just have my supplier

source: HANYA TINGGAL
en: we’re

source: ..TAPI AKU
en: however,

source: HHA
en: *pant*

source: BERAPA
en: how much

source: Saya akan kembali sebentar lagi, tuan!
en: I’ll be right back, sir!

source: DIA MINTA
en: he wants

source: NGOMONG-
en: anyway,

source: RUMAH SAKIT DR.
en: DR. ADINATA

source: MENANDINGIKU!!
en: level as me!

source: KIIIKKK...!!!
en: eekkk!!!

source: Kau mengatakannya seakan-akan aku adalah jin paling tidak kompeten..
en: the way you say it makes me feel like I’m a total incompetent jinn.

source: BRUK!
en: bump

source: SEPERTINYA DIA
en: I think

source: HRRGH!!
en: arghhh!

source: KEKUASAANKU!!
en: my territory!

source: TUH, KAN..
en: see?!

source: SEPERTI YANG
en: w-

source: SEKARANG!!!
en: now!

source: AJA NGGAK BANGUN-
en: you still wouldn’t

source: KABAR TERSEBUT..
en: the bad news.

source: WAHAI SARIMIN?!
en: sarimin?!

source: Berisik!
en: shut it!

source: KUMOHON!!
en: please!!!

source: BENAR-BENAR
en: really giving your all

source: KHU KHU KHU..
en: mwahahaha!

source: KOTA X
en: X TOWN

source: YANG MENGE-
en: recognized

source: DUAK!
en: thud

source: SEBUT AKU IMUT,
en: me cute, you fool!

source: LAGI…
en: time!

source: HA
en: huff

source: MENERIMA DAN
en: and adopted it

source: KEMARIN ITU
en: what happened yesterday

source: MU SAAT INI JUGA,
en: with my own hands,

source: TERAKHIR?
en: words?

source: WOOOYYY!!!
en: you doofus!!!

source: KAN SAJA, DEK?
en: set you up with someone!

source: KAMU MASIH ADA
en: that you were

source: DENGAR AKU,
en: listen to me,

source: PUR, BOWO..
en: purnomo and bowo...

source: SINYAL..
en: no reception...

source: AKU SATU-SATUNYA
en: really think

source: PERTUMPAHAN
en: it’s gonna be bloody,

source: M-MAAFKAN
en: forgive me,

source: BONEKANYA
en: the doll

source: BUMI, AKU TERJATUH
en: my body inward.

source: KARTU UNU
en: game.

source: NAH, UNTUK SEMENTARA GINI DULU AJA, YA..
en: alright, this should do it for now.

source: URUSAN KITA
en: we’re

source: KAMU PIKIR
en: what do you

source: Duh, males aku jelasin ke jin gaptek
en: oh my... you sure are tech illiterate.

source: PASANG BADAN BUAT
en: protect you

source: YAAA..
en: well,

source: AKU AKAN MENCERITAKAN TENTANG 'SI ITU' KE MAMAH DAN AYAH!!!
en: I’ll tell mom and dad about “that guy”!

source: YA..
en: I will.

source: KALAU KAU
en: and if you

source: ..KASURKU...
en: my bed...

source: ENAK BEGITU..?
en: so good.

source: INI PERMINTAAN
en: it’s not

source: GOMBAL MULU!!
en: flirting

source: BERFAEDAH, LEBIH BAIK
en: and whatnots, perhaps

source: GUNUNG INI KAN LUAS SEKALI!
en: so tell me, how did you find me?

source: Maaf, bukannya saya sedang menguping..
en: I didn’t mean to listen in on your conversation...

source: SUDAH MENGETAHUI
en: know

source: KAMU BERPAPASAN DENGAN MACAN JEJADIAN DAN MENCIUM BAU FAMILIAR DARINYA..
en: you met a tiger familiar who smelled familiar to you

source: DIA NGGAK AKAN NGAMBEK LAMA-LAMA...
en: she’ll be okay.

source: Apalagi sampai bertatap muka dengan tamu tersebut...
en: or even meet the guest face to face...

source: SI MAS INI..
en: with him?

source: POF!!
en: puff

source: ..KALIAN PIKIR
en: you think

source: SIAPA YA YANG
en: who should

source: Khu..
en: grrr...

source: DULU AKSES-NYA MASIH SUSAH!
en: it used to be so challenging in the past!

source: BLETAK!
en: clack

source: BAIKLAH..
en: well, then...

source: AKU
en: I

source: EH, DEK!!
en: hey!

source: PETUNJUK!
en: clue!

source: LAH BERSIKAP EGOIS DAN
en: stop thinking

source: KAMU TANYA
en: what

source: SELANGKAH LAGI
en: almost there.

source: Hngghh..
en: ugh...

source: WAJAH ORANG PEMALAS
en: when I

source: Kalian tahu kan apa yang kemungkinan bisa terjadi apabila kita gagal memberi persembahan kepada tuan Sima?!
en: I’m sure you know what could happen if we fail to give master sima an offering!

source: GLEK!
en: gulp

source: BAYAR BUAT
en: not to gaze

source: MANUSIA ITU, LANGSUNG
en: sure are fast!

source: AKAN MEMBUAT LILITAN-
en: its grip

source: AKU TIDAK BISA BERNAPAS!!!
en: I can’t breathe!!!

source: SEPERTI ITU, TAPI BIAR
en: the supernaturals, but

source: MAU BAGAIMANA
en: ...I just

source: BIAYA TUTUP MULUT
en: for the families and to shut

source: AYOK INI TASNYA DIBAWA SENDIRI-SENDIRI, YAA!
en: everyone take care of their own bags, all right?

source: KALIAN INI JUGA
en: this is my territory,

source: MUNGKIN BISA DAPAT
en: your house,

source: YASUDAHLAH!
en: just leave

source: TERNYATA MESKI
en: mr. J treats

source: TING TONG!
en: ding dong

source: KITA BERDUA
en: we underestimated

source: TEMPAT APA INI
en: what is

source: DALAM..
en: into each other’s eyes.

source: APA YANG
en: what’s

source: ADIKKU YANG SUDAH
en: I’m already late

source: BERSAMBUNG
en: to be continued...

source: BAGAIMANA
en: I need

source: Anak-anak masih di dalam tenda, kan, yah?
en: the kids are still in the tent, right?

source: ADA UNTUNGNYA
en: to gain

source: MENGERTI?!
en: understand?

source: Anak itu..
en: that kid...

source: PENIPUAN..
en: he was a con artist,

source: SUDAH-KAH TERLIHAT PETUNJUKNYA?
en: have you noticed the signs?

source: MBAK,
en: ma’am!

source: NGGAK USAH
en: hey,

source: ARAH GERAKANNYA..
en: and follow its movement.

source: WAHAI SARIMIN!!
en: to be shy!

source: ITU BANGUNAN LUASSS BANGET TAPI KOSONG..
en: that building is huge, but it has no one in it.

source: ENGGAN MENGAKUI
en: still won’t admit

source: Ini aku nyalain kembang api lagi gapapa, kan?
en: okay? okay?

source: Tidak ada yang perlu kudengar lagi, IQ ku semakin anjlok setiap selesai mengobrol denganmu, Sarimin..
en: the more I talk to you, the lower my IQ gets, so I don’t need to hear anything else.

source: SORI KALAU
en: um... I don’t

source: BAD BOY!!
en: he’s such a bad boy!

source: ABANG TERLIHAT
en: you look really cute

source: Maaf, nggak bisa :(
en: I wish I could :(

source: U..
en: extending your hand...

source: SAMBUNG, KOK BISA?!
en: the wrong spirit. how did this happen?!

source: UHHH..
en: um...

source: TIDAK..!!
en: no!

source: KOMPOR UDAH DIMATIIN KAN, MAH?
en: you’ve already turned off the stove, right?

source: *SEMBUR*
en: spurt

source: SI WASA?
en: side hustle?

source: PENDENGARANKU
en: we heard

source: SHH
en: (redacted)

source: AKU, BOWO,
en: bowo, tresno,

source: AH, TAPI KALAU
en: ah,

source: Yang jelas bukan bagian dari mereka..
en: not one of them, that’s for sure.

source: CKLAK!
en: clack

source: NYA, CEPAT ATAU
en: what’s coming

source: AH??
en: huh?

source: Permainan baru dimulai
en: game on.

source: MAU KEMANA KAMU?
en: where do you think you’re going?

source: MENDEKATLAH..
en: come closer...

source: KAU
en: keep

source: Untukku?
en: to me?

source: ..KALIAN
en: you two

source: KALAU NGGAK NAIK
en: you don’t want him

source: Maaf numpang lewat..
en: may I pass?

source: SEKARANG PUN
en: won’t

source: ..KLIEN-KLIENKU
en: most of my clients

source: Penjaga!!
en: guards!!!

source: KERAS, NIH..
en: to give them a clearer warning.

source: TIDAK SEBANDING DENGAN
en: is nothing compared

source: DENGARKAN
en: listen

source: BAT..
en: late...

source: DULU!
en: off!

source: GRUDUK
en: whirr

source: BAIKLAH!!
en: okay!

source: AKHIR-AKHIR INI BEROP-
en: lately,

source: SEJENAK SETELAH
en: as soon as I close

source: KHHH--!!
en: ecch!

source: KENAPA LAGI INI SINYALNYA ILANG LAGI?!
en: why can’t I get service again?

source: ORANG LAGI YANG
en: is still

source: LIHATLAH
en: now

source: ABANG!!
en: where

source: DEG!!!
en: thump

source: AJA, KALI..
en: lucky.

source: APA??
en: do you want?

source: EEEHHH?!?!
en: huh?!

source: JEJADIAN..!!
en: of a white snake!

source: A-ABANG
en: big bro,

source: KU…
en: he called me.

source: SENYAM-SENYUM
en: and do

source: AH..
en: oh,

source: NYA SUDAH HANCUR..
en: shattered his leg.

source: HRGH!!
en: ughhh!!!

source: Dasar tua tua kedelai!!
en: you old pervert!

source: AHLI YANG BISA
en: professional that can

source: DRRR-!!
en: bzzt

source: DUA..
en: two...

source: DI SINI?!
en: doing here?!

source: HUP
en: flap

source: TAPI TIDAK..
en: but no...

source: ..BERGERAK
en: it’s moving

source: TIDAK LAGI
en: just turned off

source: BERTUKAR PANDANG..
en: for a few seconds.

source: BUKANNYA AYAH
en: I thought

source: SETELAH MENDENGAR
en: once he heard

source: NYA UNTUK BERLUTUT
en: and make him bow

source: ..PERCAYALAH PADA KAMI, SEMUA AKAN BAIK-BAIK SAJA..
en: have some faith, everything is going to be okay.

source: KOK!!
en: so don’t worry!

source: SUDAH DATANG,
en: for coming,

source: TIDAK AKAN PERNAH
en: we’ll never know

source: KALI INI SAYA BERADA DI HALU RESTORAN MAU MENGAJAK PEMIRSA DI RUMAH SENAM AEROBIK!
en: this time, I’m at the halu restaurant, and I want to invite you to do some aerobics!

source: TERJADI?!
en: going on?!

source: LIHATLAH..
en: well, well...

source: Kita bahkan belum sempat bobok di tenda, mahhh!!!
en: we didn’t even get to sleep in the tent, mom!

source: MASIH HIDUP!!
en: the living!!!

source: PEMBICARAAN!!
en: the subject!

source: JANGAN DILIHATIN TERUS-TERUSAN..
en: stop looking at that place.

source: PAK SUNARYO!!
en: mr. sunaryo!

source: TIDAK TERJADI
en: has happened,

source: D..
en: r-

source: ..KIKKKK!!!
en: eekkk!

source: "Sopir mengantuk berujung maut, mobil keluarga masuk jurang dan menewaskan dua penumpangnya.. "
en: “the drowsy driver caused the car to fall into a ravine, killing two passengers...”

source: NGGAK ADA YANG LECET, KAN?
en: are you hurt?

source: ZLEBB!!
en: fwoosh

source: *KAGET*
en: *shocked*

source: CEPAT LAKUKAN
en: hurry and do

source: Sima, biarkan aku menghayati peranku sebagai CEO startup ghoib app
en: sima, let me act out my role as the CEO of a start-up app company for the underworld.

source: UNTUK APA?!
en: what?

source: AMBULANS!!
en: an ambulance!

source: Permisi..
en: excuse me...

source: KALAU BESOK SAJA?
en: see him tomorrow instead?

source: MUNKI INI BUKAN PELIHARAAN, TAPI TEMANKU!!!
en: munki isn’t a pet, but a friend!

source: BOLEH MINTA WAKTUNYA SEBENTAR?
en: can we have a moment?

source: ZRAA
en: swoosh
